package Zadachi.For_Loop;

public class Fibonaci {
    public static void main(String[] args) {
        int N = 10; // Брой членове от редицата за сумиране
        long sum = 0; // Променлива за сумата
        long a = 0; // Първият член от редицата
        long b = 1; // Вторият член от редицата

        for (int i = 0; i < N; i++) {
            sum += a; // Добавяме текущия член към сумата
            long temp = a + b; // Сумираме предходния и текущия член за да получим следващия
            a = b; // Присвояваме стойностите на следващия член за следващата итерация
            b = temp; // Присвояваме стойностите на следващия член за следващата итерация
        }

        System.out.println("Сумата на първите " + N + " члена от редицата на Фибоначи е: " + sum);
    }
}


